simulator-core/src/test/resources/original_files/soap_test_wrong_param.xml

<?xml version="1.0"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
   xmlns:tns="http://www.examples.com/wsdl/HelloService.wsdl">
        
   <env:Body>
     <tns:sayHello>
          <tns:lastName>Dude</tns:lastName>
     </tns:sayHello>
   </env:Body>
</env:Envelope>
