api/test/fixtures/soap/wdsl/say-hello-service-response.js

module.exports = '<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.examples.com/wsdl/HelloService.wsdl"><soap:Body><tns:sayHello><greeting>chachis</greeting></tns:sayHello></soap:Body></soap:Envelope>';
